benchmark/results/20250922-182939/bot_attack/load.log

[2025-09-22T18:43:37+03:00] phase=baseline duration=30s qps=50 concurrency=16

Summary:
  Total:	32.5028 secs
  Slowest:	10.5641 secs
  Fastest:	0.5738 secs
  Average:	3.9893 secs
  Requests/sec:	3.9074
  
  Total data:	381 bytes
  Size/request:	3 bytes

Response time histogram:
  0.574 [1]	|■
  1.573 [5]	|■■■■■
  2.572 [19]	|■■■■■■■■■■■■■■■■■■■
  3.571 [28]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.570 [40]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  5.569 [14]	|■■■■■■■■■■■■■■
  6.568 [15]	|■■■■■■■■■■■■■■■
  7.567 [0]	|
  8.566 [1]	|■
  9.565 [1]	|■
  10.564 [3]	|■■■


Latency distribution:
  10% in 2.2902 secs
  25% in 3.0018 secs
  50% in 3.8680 secs
  75% in 4.9003 secs
  90% in 6.0028 secs
  95% in 6.3985 secs
  99% in 10.5641 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.5738 secs, 10.5641 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	3.9891 secs, 0.5726 secs, 10.5631 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	127 responses



[2025-09-22T18:44:10+03:00] phase=attack duration=60s qps=300 concurrency=60

Summary:
  Total:	69.5740 secs
  Slowest:	19.9620 secs
  Fastest:	1.6577 secs
  Average:	11.1526 secs
  Requests/sec:	3.4208
  
  Total data:	339 bytes
  Size/request:	3 bytes

Response time histogram:
  1.658 [1]	|■■
  3.488 [10]	|■■■■■■■■■■■■■■■■■■■■
  5.319 [7]	|■■■■■■■■■■■■■■
  7.149 [9]	|■■■■■■■■■■■■■■■■■■
  8.979 [20]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  10.810 [12]	|■■■■■■■■■■■■■■■■■■■■■■■■
  12.640 [6]	|■■■■■■■■■■■■
  14.471 [6]	|■■■■■■■■■■■■
  16.301 [19]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  18.132 [13]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  19.962 [10]	|■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 3.8045 secs
  25% in 7.4880 secs
  50% in 10.5981 secs
  75% in 15.7994 secs
  90% in 18.1079 secs
  95% in 19.7027 secs
  99% in 19.9620 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 1.6577 secs, 19.9620 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	11.1519 secs, 1.6551 secs, 19.9595 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	113 responses

Error distribution:
  [125]	Get "http://127.0.0.1:18080/": context deadline exceeded (Client.Timeout exceeded while awaiting headers)


[2025-09-22T18:45:19+03:00] phase=cooldown duration=30s qps=40 concurrency=12

Summary:
  Total:	31.6646 secs
  Slowest:	5.6012 secs
  Fastest:	0.7017 secs
  Average:	2.8701 secs
  Requests/sec:	4.1055
  
  Total data:	390 bytes
  Size/request:	3 bytes

Response time histogram:
  0.702 [1]	|■■
  1.192 [15]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.682 [6]	|■■■■■■■■■■■■
  2.172 [20]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.661 [18]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.151 [20]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.641 [15]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.131 [10]	|■■■■■■■■■■■■■■■■■■■■
  4.621 [11]	|■■■■■■■■■■■■■■■■■■■■■■
  5.111 [6]	|■■■■■■■■■■■■
  5.601 [8]	|■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 1.1173 secs
  25% in 1.8974 secs
  50% in 2.8088 secs
  75% in 3.8820 secs
  90% in 4.8333 secs
  95% in 5.2007 secs
  99% in 5.6012 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.7017 secs, 5.6012 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	2.8699 secs, 0.7015 secs, 5.6007 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [200]	130 responses